# Data Aggregation
- to compute statistics on a group of data
- groupby operation: idea behind groupby operation is split-apply-combine
- analyze one or more Series based on a set of categories
- [Aggregate Functions](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#aggregation)

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Name': ['Calvin', 'Emmanuela', 'Gulen', 'Jasman', 'Jean', 'Kurtis', 'Kyle'],
    'Company': 'Amazon Google Amazon Amazon Google IBM IBM'.split(),
    'Salary': [205, 125, 150, 160, 150, 115, 135]
}
df = pd.DataFrame(data)
df

        Name Company  Salary
0     Calvin  Amazon     205
1  Emmanuela  Google     125
2      Gulen  Amazon     150
3     Jasman  Amazon     160
4       Jean  Google     150
5     Kurtis     IBM     115
6       Kyle     IBM     135

In [6]:
# get the average salary of the individuals who work in Amazon
df[df['Company'] == 'Amazon']['Salary'].mean()

171.66666666666666

In [8]:
dataByCompany = df.groupby(df['Company'])
dataByCompany.mean()

             Salary
Company
Amazon   171.666667
Google   137.500000
IBM      125.000000

In [11]:
dataByCompany.mean().loc['Amazon']

Salary    171.666667
Name: Amazon, dtype: float64

In [13]:
dataByCompany.mean().iloc[0]

Salary    171.666667
Name: Amazon, dtype: float64

In [14]:
dataByCompany.mean().iloc[1]

Salary    137.5
Name: Google, dtype: float64

In [15]:
dataByCompany.mean().loc['Google']

Salary    137.5
Name: Google, dtype: float64

In [16]:
df.groupby(df['Company']).mean()

             Salary
Company
Amazon   171.666667
Google   137.500000
IBM      125.000000

In [17]:
df.groupby(df['Company']).count()

         Name  Salary
Company
Amazon      3       3
Google      2       2
IBM         2       2

In [18]:
df

        Name Company  Salary
0     Calvin  Amazon     205
1  Emmanuela  Google     125
2      Gulen  Amazon     150
3     Jasman  Amazon     160
4       Jean  Google     150
5     Kurtis     IBM     115
6       Kyle     IBM     135

In [19]:
df.describe()

           Salary
count    7.000000
mean   148.571429
std     29.398737
min    115.000000
25%    130.000000
50%    150.000000
75%    155.000000
max    205.000000

In [20]:
df.groupby('Company').describe()

        Salary
         count        mean        std    min     25%    50%     75%    max
Company
Amazon     3.0  171.666667  29.297326  150.0  155.00  160.0  182.50  205.0
Google     2.0  137.500000  17.677670  125.0  131.25  137.5  143.75  150.0
IBM        2.0  125.000000  14.142136  115.0  120.00  125.0  130.00  135.0

In [21]:
df.groupby('Company').describe().loc['IBM']

Salary  count      2.000000
        mean     125.000000
        std       14.142136
        min      115.000000
        25%      120.000000
        50%      125.000000
        75%      130.000000
        max      135.000000
Name: IBM, dtype: float64

In [23]:
df.groupby('Company').describe().transpose()

Company           Amazon     Google         IBM
Salary count    3.000000    2.00000    2.000000
       mean   171.666667  137.50000  125.000000
       std     29.297326   17.67767   14.142136
       min    150.000000  125.00000  115.000000
       25%    155.000000  131.25000  120.000000
       50%    160.000000  137.50000  125.000000
       75%    182.500000  143.75000  130.000000
       max    205.000000  150.00000  135.000000

In [24]:
df.groupby('Company').describe().transpose()['IBM']

Salary  count      2.000000
        mean     125.000000
        std       14.142136
        min      115.000000
        25%      120.000000
        50%      125.000000
        75%      130.000000
        max      135.000000
Name: IBM, dtype: float64

In [25]:
np.random.seed(1234)
data = {
    'key1': ' a a b b a'.split(),
    'key2': 'one two one two one'.split(),
    'data1': abs(np.random.randn(5)),
    'data2': abs(np.random.randn(5))
}
df = pd.DataFrame(data)
df

  key1 key2     data1     data2
0    a  one  0.471435  0.887163
1    a  two  1.190976  0.859588
2    b  one  1.432707  0.636524
3    b  two  0.312652  0.015696
4    a  one  0.720589  2.242685

In [27]:
grouped = df['data1'].groupby(df['key1'])
grouped.mean()

key1
a    0.794333
b    0.872679
Name: data1, dtype: float64

In [29]:
df['data1'].groupby([df['key1'], df['key2']]).mean()

key1  key2
a     one     0.596012
      two     1.190976
b     one     1.432707
      two     0.312652
Name: data1, dtype: float64

In [30]:
df['data1'].groupby([df['key1'], df['key2']]).mean().unstack()

key2       one       two
key1
a     0.596012  1.190976
b     1.432707  0.312652

In [31]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.596012  1.564924
     two   1.190976  0.859588
b    one   1.432707  0.636524
     two   0.312652  0.015696

In [32]:
df.groupby('key1')

In [33]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)
    print('\n')

a
  key1 key2     data1     data2
0    a  one  0.471435  0.887163
1    a  two  1.190976  0.859588
4    a  one  0.720589  2.242685


b
  key1 key2     data1     data2
2    b  one  1.432707  0.636524
3    b  two  0.312652  0.015696

In [34]:
import seaborn as sns

In [35]:
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [36]:
# group the dataset by 'time'
grouped = df.groupby('time')
grouped

In [37]:
for time, data in grouped:
    print(time)
    print(data)
    print('\n')

Lunch
     total_bill   tip     sex smoker   day   time  size
77        27.20  4.00    Male     No  Thur  Lunch     4
78        22.76  3.00    Male     No  Thur  Lunch     2
79        17.29  2.71    Male     No  Thur  Lunch     2
80        19.44  3.00    Male    Yes  Thur  Lunch     2
81        16.66  3.40    Male     No  Thur  Lunch     2
..          ...   ...     ...    ...   ...    ...   ...
222        8.58  1.92    Male    Yes   Fri  Lunch     1
223       15.98  3.00  Female     No   Fri  Lunch     3
224       13.42  1.58    Male    Yes   Fri  Lunch     2
225       16.27  2.50  Female    Yes   Fri  Lunch     2
226       10.09  2.00  Female    Yes   Fri  Lunch     2

[68 rows x 7 columns]


Dinner
     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[176 rows x 7 columns]

In [38]:
grouped.first()

        total_bill   tip     sex smoker   day  size
time
Lunch        27.20  4.00    Male     No  Thur     4
Dinner       16.99  1.01  Female     No   Sun     2

In [39]:
grouped.get_group('Lunch')

     total_bill   tip     sex smoker   day   time  size
77        27.20  4.00    Male     No  Thur  Lunch     4
78        22.76  3.00    Male     No  Thur  Lunch     2
79        17.29  2.71    Male     No  Thur  Lunch     2
80        19.44  3.00    Male    Yes  Thur  Lunch     2
81        16.66  3.40    Male     No  Thur  Lunch     2
..          ...   ...     ...    ...   ...    ...   ...
222        8.58  1.92    Male    Yes   Fri  Lunch     1
223       15.98  3.00  Female     No   Fri  Lunch     3
224       13.42  1.58    Male    Yes   Fri  Lunch     2
225       16.27  2.50  Female    Yes   Fri  Lunch     2
226       10.09  2.00  Female    Yes   Fri  Lunch     2

[68 rows x 7 columns]

In [40]:
df.groupby('time').mean()

        total_bill       tip      size
time
Lunch    17.168676  2.728088  2.411765
Dinner   20.797159  3.102670  2.630682

In [41]:
df.groupby('time')['total_bill'].mean()

time
Lunch     17.168676
Dinner    20.797159
Name: total_bill, dtype: float64

In [44]:
# question: find the largest group size and the maximum tip amount for each of the time (lunch and dinner)
df.groupby('time')[['size', 'tip']].max()

        size   tip
time
Lunch      6   6.7
Dinner     6  10.0

In [45]:
# question: find the smallest group size and the maximum tip amount for each of the time (lunch and dinner)
df.groupby('time').agg({'size': np.min, 'tip': np.max})

        size   tip
time
Lunch      1   6.7
Dinner     1  10.0

In [46]:
df.groupby('time')[['size', 'tip']].agg(np.max)

        size   tip
time
Lunch      6   6.7
Dinner     6  10.0

In [47]:
# question: find the number of records and the average total_bill amount for each of the time (lunch and dinner)
df.groupby('time')['total_bill'].agg(['count','mean'])

        count       mean
time
Lunch      68  17.168676
Dinner    176  20.797159

In [49]:
# question: find the average amount of total bill and tip for each of the time and gender group
df.groupby(['time', 'sex'])[['total_bill', 'tip']].mean()

               total_bill       tip
time   sex
Lunch  Male     18.048485  2.882121
       Female   16.339143  2.582857
Dinner Male     21.461452  3.144839
       Female   19.213077  3.002115

In [50]:
df.groupby(['time', 'sex'], as_index = False)[['total_bill', 'tip']].mean()

     time     sex  total_bill       tip
0   Lunch    Male   18.048485  2.882121
1   Lunch  Female   16.339143  2.582857
2  Dinner    Male   21.461452  3.144839
3  Dinner  Female   19.213077  3.002115

In [52]:
df = pd.DataFrame(df.groupby(['time', 'sex'], as_index = False)[['total_bill', 'tip']].mean())
df

     time     sex  total_bill       tip
0   Lunch    Male   18.048485  2.882121
1   Lunch  Female   16.339143  2.582857
2  Dinner    Male   21.461452  3.144839
3  Dinner  Female   19.213077  3.002115

In [53]:
df.groupby(['time', 'sex'])[['total_bill', 'tip']].agg(np.mean)

               total_bill       tip
time   sex
Lunch  Male     18.048485  2.882121
       Female   16.339143  2.582857
Dinner Male     21.461452  3.144839
       Female   19.213077  3.002115